export const BOOK_TYPE_ENUM = [
  { id: 1, name: '文学' },
  { id: 2, name: '学习教育' },
  { id: 3, name: '少儿读物' },
  { id: 4, name: '名著' },
  { id: 5, name: '典籍' },
  { id: 6, name: '历史' },
  { id: 7, name: '应用技术' },
  { id: 99, name: '其他' },
]

export const BOOK_LIST = [
  {
    id: 1,
    type: '1,4',
    title: '红楼梦',
    author: '曹雪芹',
    owner: '李兆',
    score: 9.7,
    seq: 100,
    cover: 'https://yizhao-1259410276.cos.ap-shanghai.myqcloud.com/images/%E5%BE%AE%E4%BF%A1%E5%9B%BE%E7%89%87_20260113234828_231_2.jpg',
    description: '一部中国文学史上的鸿篇巨制，以其丰富的思想内容、伟大的艺术成就和深远的文化影响成为中国古典文学史上的一朵奇葩。',
    summaries: [
      "《红楼梦》又名《石头记》，是中国古典小说的巅峰之作，位居“中国古典四大名著”之首。",
      "以贾、史、王、薛四大家族的兴衰为背景，以富贵公子贾宝玉为视角，以贾宝玉与林黛玉、薛宝钗的爱情婚姻悲剧为主线，描绘了一些闺阁佳人的人生百态，展现了真正的人性美和悲剧美，是一部从各个角度展现女性美以及中国古代社会百态的史诗性著作。"
    ],
    tags: ['必读', '经典推荐', '珍藏'],
    highlights: [
      '满纸荒唐言，一把辛酸泪。都云作者痴，谁解其中味？',
      '假作真时真亦假，无为有处有还无。',
      '世事洞明皆学问，人情练达即文章。',
      '<div style="font-weight: bold;">莫失莫忘，仙寿恒昌；不离不弃，芳龄永继。</div>',
      '滴不尽相思血泪抛红豆，开不完春柳春花满画楼，睡不稳纱窗风雨黄昏后，忘不了新愁与旧愁。',
      '恰便似遮不住的青山隐隐，流不断的绿水悠悠。',
      '世人都晓神仙好，惟有功名忘不了！古今将相在何方？荒冢一堆草没了。',
      '霁月难逢，彩云易散，心比天高，身为下贱。风流灵巧招人怨，寿夭多因诽谤生，多情公子空牵念。',
      '欲洁何曾洁，云空未必空。可怜金玉质，终陷淖泥中。',
      '人有聚就有散，聚时欢喜，到散时岂不清冷？既清冷则伤感，所以不如倒是不聚的好。',
      '幸于始者怠于终，缮其辞者嗜其利。',
      '不求大士瓶中露，为乞孀娥槛外梅。'
    ]
  },
  {
    id: 2,
    type: '1,4',
    title: '西游记',
    author: '吴承恩',
    owner: '李兆',
    score: 9.5,
    seq: 100,
    cover: 'https://yizhao-1259410276.cos.ap-shanghai.myqcloud.com/images/%E5%BE%AE%E4%BF%A1%E5%9B%BE%E7%89%87_20260113234828_231_2.jpg',
    description: "中国古代第一部浪漫主义章回体神魔小说，以奇幻笔法讲述取经之路，寓含修心证道的深刻哲理。",
    summaries: [
      "《西游记》是中国神魔小说的经典之作，讲述了唐僧师徒四人西天取经、历经九九八十一难的故事。",
      "小说以孙悟空出世、大闹天宫为开端，以唐僧收服孙悟空、猪八戒、沙僧为徒，一同前往西天取经为主线，通过一系列降妖伏魔的险阻，歌颂了不畏艰险、追求真理的精神，并塑造了孙悟空这一充满反抗与智慧精神的经典形象。"
    ],
    tags: ["神话", "冒险", "修心"],
    highlights: [
      "<div style='font-weight: bold;'>宁恋本乡一捻土，莫爱他乡万两金。</div>",
      "山高自有客行路，水深自有渡船人。",
      "观棋柯烂，伐木丁丁，云边谷口徐行，卖薪沽酒，狂笑自陶情。",
      "扫地恐伤蝼蚁命，爱惜飞蛾纱罩灯。",
      "世间事，常难遂人愿，且看明月又有几回圆？",
      "你紧闭双眼，还说什么四大皆空？你若真的四大皆空，为什么不敢睁眼看我？你若真的睁眼看我，我不信你会两眼空空……"
    ]
  },
  {
    id: 3,
    type: '1,4',
    title: '三国演义',
    author: '罗贯中',
    owner: '李兆',
    score: 9.5,
    seq: 100,
    cover: 'https://yizhao-1259410276.cos.ap-shanghai.myqcloud.com/images/%E5%BE%AE%E4%BF%A1%E5%9B%BE%E7%89%87_20260113234828_231_2.jpg',
    description: "中国第一部长篇章回体历史演义小说，以宏大的叙事结构描绘了东汉末年至西晋初年的百年风云，被誉为“谋略之书，英雄之史”。",
    summaries: [
      "《三国演义》全名为《三国志通俗演义》，以陈寿《三国志》为蓝本，艺术化地再现了魏、蜀、吴三国之间的政治与军事斗争。",
      "小说以“天下大势，分久必合，合久必分”为历史脉络，集中描绘了官渡之战、赤壁之战等波澜壮阔的战争场面，塑造了诸葛亮、周瑜、关羽、曹操、吕布、太史慈等数百个性格鲜明的英雄形象，深刻影响了中国民众的历史观与价值观。"
    ],
    tags: ["历史", "战争", "谋略"],
    highlights: [
      "滚滚长江东逝水，浪花淘尽英雄。是非成败转头空。青山依旧在，几度夕阳红。<br/>白发渔樵江渚上，惯看秋月春风。一壶浊酒喜相逢。古今多少事，都付笑谈中。",
      "天下大势，分久必合，合久必分。",
      "<div style='font-weight: bold;'>大丈夫生居天地间，岂能郁郁久居人下！</div>",
      "人中吕布，马中赤兔。",
      "我剑也未尝不利！",
      "大丈夫生于乱世，当带三尺剑立不世之功；今所志未遂，奈何死乎！",
      "宁教我负天下人，休教天下人负我。",
      "曲有误，周郎顾",
      "既生瑜，何生亮！",
      "大丈夫处世，不能立功建业，不几与草木同腐乎！",
      "玉可碎，而不可改其白；竹可焚，而不可毁其节；身虽死，名可垂于竹帛也。",
      "夫英雄者，胸怀大志，腹有良谋，有包藏宇宙之机，吞吐天地之志者也。",
      "吾闻勇将不怯死以苟免，壮士不毁节而求生。今日乃我死日也。汝可努力死战。",
      "将军有剑，不斩苍蝇。",
      "若举江东之众，决机于两阵之间，与天下争衡，卿不如我；举贤任能，使各尽力以保江东，我不如卿。",
      "我被酒色所伤，竟然如此憔悴。自今日始，戒酒！",
      "深感人生之艰难，就像那不息之长河，虽有东去大海之志，却流程缓慢，征程多艰。哎...然江河水总有入海之时，而人生之志，却常常难以实现，令人抱恨终生！",
      "涓滴之水汇成江河，已属不易，奔流向前，汇入大海之时，更会倍感自身之渺茫..."
    ]
  },
  {
    id: 4,
    type: '1,4',
    title: '水浒传',
    author: '施耐庵',
    owner: '李兆',
    score: 9,
    seq: 100,
    cover: 'https://yizhao-1259410276.cos.ap-shanghai.myqcloud.com/images/%E5%BE%AE%E4%BF%A1%E5%9B%BE%E7%89%87_20260113234828_231_2.jpg',
    description: "中国文学史上第一部白话文章回体小说，以官逼民反为主题，生动刻画了梁山泊一百零八位好汉的群像，堪称一部平民英雄的悲壮史诗。",
    summaries: [
      "《水浒传》又名《忠义水浒传》，讲述了北宋末年以宋江为首的绿林好汉在梁山泊聚义、接受招安、最终四散凋零的故事。",
      "小说通过“鲁智深倒拔垂杨柳”“武松打虎”“林冲雪夜上梁山”等经典篇章，深刻揭露了封建社会的黑暗与腐败，歌颂了反抗压迫、讲求义气的英雄精神，同时也对招安悲剧进行了深沉反思。"
    ],
    tags: ["英雄", "义气", "反抗"],
    highlights: [
      "太平本是将军定，不许将军见太平。",
      "饥不择食，寒不择衣，慌不择路，贫不择妻。",
      "世味薄方好，人情淡最长。",
      "失群的孤雁，趁月明独自贴天飞；漏网的活鱼，乘水势翻身冲浪跃。不分远近，岂顾高低。心忙撞倒路行人，脚快有如临阵马。",
      "我于路不曾害！酒也吃得，肉也吃得，饭也吃得，路也走得",
      "不曾害，不曾害！打了倒干净。我不要留这一顿寄库棒，寄下倒是钩肠债，几时得了！",
      "平生不修善果，只爱杀人放火。忽地顿开金枷，这里扯断玉锁。咦！钱塘江上潮信来，今日方知我是我。",
    ]
  },
].sort((a, b) => b.seq - a.seq)